Autodesk.Revit.DB.Structure.TranslationRotationValue
Specifies the type of condition applied to the translation or rotation parameter.

Autodesk.Revit.DB.Structure.TranslationRotationValue.Spring
The type of condition is Spring.

Autodesk.Revit.DB.Structure.TranslationRotationValue.Release
The type of condition is Release.

Autodesk.Revit.DB.Structure.TranslationRotationValue.Fixed
The type of condition is Fixed.